app/controllers/bank_controller.rb

  def create
  #workbook = Spreadsheet::ParseExcel.parse(params[:xcel_file])
   #worksheet = workbook.worksheet(0)
     #@columns = Array.new
   #worksheet.row(0).each_with_index { |cl,i|
         # @columns[i] = cl.type.to_s
    #}
   # render :text=>@columns.inspect.to_s
=begin worksheet.each(0) { |row|
                    bank = Bank.new
                    bank.user_id = current_user.id
                    bank.transaction_date = row.at(0).date
                        if row.at(1).to_f < 0
                          bank.debit = ((row.at(1).to_f) * -1)
                          bank.unallocated_mny = bank.debit
                        else
                          bank.credit = row.at(1).to_f
                          bank.unallocated_mny = bank.credit
                       end
                   bank.description = row.at(4).to_s('latin1') if row.at(4) != nil
                    bank.vendor_client = row.at(5).to_s('latin1') if row.at(5) != nil
                    bank.save
---
INSERT INTO `banks` (`debit`, `updated_at`, `credit`, `transaction_date`, `description`, `vendor_client`, `user_id`, `created_at`) VALUES(-405.0, '2010-09-16 09:57:32', NULL, '2010-09-15', 'MISCELLANEOUS DEBIT DEBIT', 'OUTSTANDING TRANS #4017-9540-2048-5133', NULL, '2010-09-16 09:57:32')

 def list
   #@bank_statements =current_user.bank_statements
   @bank_statements=current_user.bank_statements.paginate :page => params[:page], :order => 'created_at DESC'
---
SELECT * FROM `banks` WHERE (`banks`.user_id = 6)

 def list_unallocated
   #@bank_statements = Bank.find(:all, :conditions=>[" user_id = ? && unallocated_mny != 0", current_user.id])
   @bank_statements = current_user.bank_statements.paginate :page => params[:page], :conditions=>["unallocated_mny != 0", current_user.id],:order => 'created_at DESC'
---
SELECT * FROM `banks` WHERE (`banks`.user_id = 6)

 def edit_statement
   @statement = Bank.find(params[:id])
---
SELECT * FROM `banks` WHERE (`banks`.`id` = 3)