app/controllers/clients_controller.rb

  def index
    @search = Client.search(params[:search])
    if params[:search] && !params[:search].blank?

       @clients = @search.all(:conditions=>["deleted LIKE ?",0],:include=>:client_contacts)
---
SELECT * FROM `clients` WHERE ((clients.organisation LIKE '%k%') AND (clients.notes LIKE '%re%'))
SELECT * FROM `client_contacts` WHERE (`client_contacts`.client_id = 1) LIMIT 1

    def create
      #render :text => params.inspect and return
     @client = Client.new(params[:client])
     @client.user_id = current_user.id
     @client.save ? (redirect_to :controller => "clients") : (render :action => :new)
---
INSERT INTO `clients` (`send_invoices`, `city`, `secondary_country`, `updated_at`, `sec_address_street1`, `sec_state`, `business_phone`, `country`, `zip_code`, `sec_address_street2`, `notes`, `fax`, `address_street1`, `sec_city`, `sec_zip_code`, `organisation`, `address_street2`, `state`, `created_at`) VALUES(1, 'city', 'India', '2010-09-25 10:20:07', 'street 2', 'st', '970422096', 'India', 'code', 'street 2', 'none', '', 'addreaa', 'city', 'c', 'Krishna soft sol', 'street1', 'state', '2010-09-25 10:20:07')

   def update
     @client.update_attributes(params[:client]) ? (redirect_to :controller => "clients") : (render :action => :edit, :id => params[:id])
---
UPDATE `clients` SET `send_invoices` = 1, `updated_at` = '2010-09-25 08:31:13' WHERE `id` = 9