app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save!
---
INSERT INTO `users` (`last_login_at`, `last_request_at`, `updated_at`, `company_name`, `crypted_password`, `package_email`, `login_page_url`, `single_access_token`, `perishable_token`, `current_login_ip`, `password_salt`, `current_login_at`, `is_active`, `failed_login_count`, `persistence_token`, `login_count`, `package_id`, `login`, `last_login_ip`, `created_at`) VALUES(NULL, '2010-09-13 05:56:36', '2010-09-13 05:56:36', 'abcd', '7e9c665c52099fcd8e08360219dc13d5599613b82a863cc0ef8db5005e86b83300455516e463b9eb8466ee7a268d2f5a8d0eb49bb429c9f0a7a7e77e07f9c510', 'm.vijaysekhar@gmail.com', 'sekhar', 'P0VOFHzPZk88kFf86bI', 'jQOWsA9CuPIKpWabtvAu', '127.0.0.1', 'Fe1vyeZaYsqR76SF72', '2010-09-13 05:56:36', 1, 0, '649c8879acad52d7baaae66c7418b003f544f8f71a033d86e3b0c631aedff03c99ff160257141edb4c8283f6fcba1f359647d1c6eb9ddd42e82ece0049a9cdad', 1, 1, 'sekhar', NULL, '2010-09-13 05:56:36')

    def checkdomain
      user = User.find_by_login_page_url(params[:domain])
---
SELECT * FROM `users` WHERE (`users`.`login_page_url` = 'didier') LIMIT 1

    def profile
        @user = current_user
        @user_profile = current_user.user_profile
          if request.post?
            if @user.update_attributes(params[:user])
---
UPDATE `users` SET `perishable_token` = 'rVx8defX1-t4OTQig6xi', `updated_at` = '2010-09-27 03:30:19', `last_request_at` = '2010-09-27 03:30:19' WHERE `id` = 1

  def color_logo
      @user_setting= current_user.user_setting.blank? ? UserSetting.new(params[:user_setting]) : current_user.user_setting
---
SELECT * FROM `user_settings` WHERE (`user_settings`.user_id = 1) LIMIT 1

  def save_settings
      user_setting = UserSetting.new(params[:user_setting])
      user_setting.user_id=current_user.id
      user_setting.save
---
INSERT INTO `user_settings` (`logo_updated_at`, `quality_logo_updated_at`, `updated_at`, `area1_color`, `invoice_logo_content_type`, `quality_logo_content_type`, `area2_color`, `invoice_logo_updated_at`, `logo_file_name`, `quality_logo_file_name`, `invoice_logo_file_name`, `quality_logo_file_size`, `invoice_logo_file_size`, `user_id`, `logo_content_type`, `logo_file_size`, `created_at`, `area3_color`) VALUES(NULL, NULL, '2010-09-27 03:51:19', '#195a8c', NULL, NULL, '#dddddd', NULL, NULL, NULL, NULL, NULL, NULL, 1, NULL, NULL, '2010-09-27 03:51:19', '#7295b2')