app/controllers/user_sessions_controller.rb

  def find_domains
     if request.post?
       @pages = User.find(:all, :conditions => ["package_email like ?",params[:email].to_s])
      flash[:error] = "Sorry, no login pages found"    if @pages.blank?
---
SELECT * FROM `users` WHERE (`users`.`package_email` = 'm.vijaysekhar@gmail.com') LIMIT 1
SELECT * FROM `users` LIMIT 1